Revit 2027 API
PartMakerMethodToDivideVolumes.DivisionPatternMirror Property
 Whether pattern defined by the division rule should be mirrored before application Mirroring is similar to changing indices of u-const gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DivisionPatternMirror { get; set; }
Public Property DivisionPatternMirror As Boolean
	Get
	Set
public:
property bool DivisionPatternMirror {
	bool get ();
	void set (bool value);
}
member DivisionPatternMirror : bool with get, set
Property Value
Boolean
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace